error_message = """ \
Что-то пошло не так, свяжитесь с тех. поддержкой
"""

greeting = "👋"

ai_model_choice = "Выберите режим 👇"


chat_model_tip = """ \
Для более чётко сформулированных ответов бота задавайте вопросы давая больше деталей (промптов).
❌ Такой себе запрос: 
<code>
- Как больше зарабатывать?
</code>
✅ Отличный запрос:
<code>
- Дай 5 советов по торговле на фондовых рынках. Ответ на русском языке
</code>
"""
image_model_tip = """ \
Для более чётко сформулированных ответов бота задавайте вопросы давая больше деталей (промптов).
❌ Такой себе запрос: 
<code>- Нарисуй котиков</code>
✅ Отличный запрос:
<code> - Постапокалиптическое будущее, бункер, на стенах плакаты Советского союза, фокус на атмосфере, детали чётко проработаны</code>

"""

models_tips = {
	"text-davinci-003": chat_model_tip,
	"image-alpha-001": image_model_tip
}


admin_user_untered = "<code>{USER_ID}</code> | @{username} зашёл в бота"